"""
Задание 2. Выполнить логические побитовые операции "И", "ИЛИ"
и др. над числами 5 и 6. Выполнить
над числом 5 побитовый сдвиг вправо и влево на два знака.

Подсказка: это стандартные операции, которые осуществляются с помощью
стандартных операторов. Попробуйте найти каких именно.
"""

print(f'Результат побитового "И" над числами 5 и 6 = {5 & 6}')
print(f'Результат побитового "ИЛИ" над числами 5 и 6 = {5 | 6}')
print(f'Результат побитового сдвига влево числа 5 = {5 << 2}')
print(f'Результат побитового сдвига вправо числа 5 = {5 >> 2}')